package ru.urfu.droidpractice1.data

object RecipeMock {
    val recipe = Recipe(
        ingredients = listOf(
            Ingredient("Тыква", "500 гр."),
            Ingredient("Мука", "30 гр."),
            Ingredient("Яйца", "1 шт."),
            Ingredient("Соль", "1 ч.л.<")
        ),
        steps = listOf(
            Step(
                "https://static.1000.menu/res/380/img/content-v2/19/3f/622/oladi-iz-tjkvj_1602064384_1_max.jpg",
                "Как приготовить оладьи из тыквы быстро и просто? Подготовьте продукты. Вес тыквы указан до ее очистки. Муки может уйти чуть больше или чуть меньше, это зависит от сочности тыквы. Можно жарить такие оладьи на сухой сковороде, тогда не понадобится масло."
            ),
            Step(
                "https://static.1000.menu/res/380/img/content-v2/19/3f/622/oladi-iz-tjkvj_1602064384_2_max.jpg",
                "Тыкву помойте и очистите от кожуры и семян. Будьте осторожны, тыква очень твердый овощ, не порежьтесь! Удобнее будет разрезать ее на небольшие кусочки и чистить их отдельно."
            ),
            Step(
                "https://static.1000.menu/res/380/img/content-v2/19/3f/622/oladi-iz-tjkvj_1602064384_3_max.jpg",
                "Натрите тыкву на терке. Какого размера выбрать отверстия? Решать вам. Можно использовать самую крупную, на ней натереть тыкву будет проще и быстрее всего. Но тогда оладьи придется дольше жарить, иначе тыква в них останется жесткой. Можно натереть на самой мелкой - получится практически пюре. Оладьи из него будут самые нежные, но придется потрудиться. Я всегда тру на средней. И быстро, и вкусно."
            ),
            Step(
                "https://static.1000.menu/res/380/img/content-v2/19/3f/622/oladi-iz-tjkvj_1602064384_4_max.jpg",
                "Добавьте к тыкве яйцо и соль. Просейте муку. Так как мы не добавляем ни соды, ни разрыхлителя, именно просеивание даст небольшую пышность оладьям."
            ),
            Step(
                "https://static.1000.menu/res/380/img/content-v2/19/3f/622/oladi-iz-tjkvj_1602064384_5_max.jpg",
                "Хорошо перемешайте все ингредиенты до состояния однородного теста. У меня была тыква средней сочности, тесто получилось достаточно густым. Но и оладьи из него хорошо держали форму, их было легко переворачивать. Если ваше тесто жидкое, добавьте еще немного муки. Но не переборщите, чтобы не забить вкус тыквы."
            ),
            Step(
                "https://static.1000.menu/res/380/img/content-v2/19/3f/622/oladi-iz-tjkvj_1602064384_6_max.jpg",
                "Разогрейте сковороду на среднем огне. Налейте масло. Его тоже хорошо прогрейте, чтобы оладьи не прилипли. Если вы жарите их без масла, то лучше выбрать сковороду с антипригарным покрытием. Выкладывайте тесто ложкой на сковороду, формируя круглые оладьи."
            ),
            Step(
                "https://static.1000.menu/res/380/img/content-v2/19/3f/622/oladi-iz-tjkvj_1602064384_7_max.jpg",
                "Обжаривайте оладьи с обеих сторон до золотистой корочки на небольшом огне, по паре минут с каждой стороны. Если вы натирали тыкву на крупной терке, то подержите их немного под крышкой, чтобы тыква успела проготовиться. Готовые оладьи снимите со сковороды и сразу подавайте на стол. Очень хорошо к ним подходит сметана. Других добавок можно и не брать - тыква сама по себе очень яркая по вкусу."
            )
        )
    )
}